cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'imagemagick'
brew 'node'
brew 'readline'
brew 'roundup'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'ant'
brew 'autoconf'
brew 'automake'
brew 'chromedriver'
brew 'cmake'
brew 'cscope'
brew 'ctags'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'gdbm'
brew 'grc'
brew 'libusb'
brew 'pinentry'
brew 'gnupg'
brew 'go'
brew 'gpg-agent'
brew 'groovy'
brew 'iperf3'
brew 'jmeter'
brew 'openssl'
brew 'libssh2'
brew 'libtool'
brew 'libusb-compat'
brew 'libyaml'
brew 'lua'
brew 'mackup'
brew 'sqlite'
brew 'python'
brew 'python3'
brew 'macvim', args: ['with-override-system-vim']
brew 'maven'
brew 'mercurial'
brew 'node'
brew 'oniguruma'
brew 'phantomjs'
brew 'pkg-config'
brew 'qt'
brew 'redis', restart_service: true
brew 'rust'
brew 'watchman'

cask 'cargo'
cask '1password'
cask 'atom'
cask 'google-chrome'
cask 'handbrake'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'vlc'
