tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "caskroom/versions"
tap "caskroom/fonts"

# Languages
brew "go"
brew "lua"
brew "rust"
cask "java8"
brew "groovy"
brew "python"

# Shells
brew "bash"
brew "fish"
brew "grc"
brew "zsh"

# Build Tools
brew "cmake"
brew "ant"
brew "heroku"
brew "maven"
cask "cargo"

# Tools
brew "ack"
brew "ctags"
brew "coreutils"
brew "imagemagick"
brew "iperf3"
brew "jmeter"
brew "fzf"
brew "mackup"
brew "watchman"
brew "wget"
brew "the_silver_searcher"
brew "unrar"
brew "sqlite"
brew "zplug" # Plugin manager for zsh
brew "z"

# Dependencies
brew "libpq"

# Text Editing
brew "macvim", args: ["with-override-system-vim"]
brew "neovim"

# Browser Testing
brew "chromedriver"
brew "phantomjs"

# Apps
cask "1password"
cask "iterm2"
cask "sublime-text"
cask "transmission"
cask "intellij-idea-ce"
cask "google-chrome"
cask "launchbar"
cask "slack"
cask "discord"

