tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "thoughtbot/formulae"
cask "java"
brew "ack"
brew "ant"
brew "autoconf"
brew "automake"
brew "chromedriver"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "fish"
brew "gdbm"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gpg-agent"
brew "openssl"
brew "sqlite"
brew "python3"
brew "grc"
brew "groovy"
brew "heroku"
brew "libtool"
brew "imagemagick"
brew "iperf3"
brew "jmeter"
brew "libssh2"
brew "libusb-compat"
brew "libyaml"
brew "lua"
brew "mackup"
brew "python"
brew "macvim", args: ["with-override-system-vim"]
brew "maven"
brew "mercurial"
brew "neovim"
brew "oniguruma"
brew "phantomjs"
brew "pkg-config"
brew "qt"
brew "redis", restart_service: true
brew "roundup"
brew "rust"
brew "spaceman-diff"
brew "the_silver_searcher"
brew "unrar"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh-syntax-highlighting"
brew "thoughtbot/formulae/rcm"
cask "1password"
cask "atom"
cask "cargo"
cask "transmission"
